Tekla.Structures.Model.UI.ClipPlane
The ClipPlane class defines a clip plane which can be used together with a visible view.
The following example shows how three ClipPlanes are created to the first visible view:
using System;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
public class ClipPlaneExample
{
public void ClipPlaneExample1()
{
ModelViewEnumerator ViewEnum = ViewHandler.GetVisibleViews();
ViewEnum.MoveNext();
View ActiveView = ViewEnum.Current;
ClipPlane CPlane = new ClipPlane();
CPlane.View = ActiveView;
CPlane.UpVector = new Vector(1, 0, 0);
CPlane.Location = new Point(20000, 10000, 5000);
CPlane.Insert();
CPlane.UpVector = new Vector(0, 1, 0);
CPlane.Location = new Point(10000, 20000, 2000);
CPlane.Insert();
CPlane.UpVector = new Vector(0, 0, 1);
CPlane.Location = new Point(20000, 20000, 6000);
CPlane.Insert();
}
}

Tekla.Structures.Model.UI.ClipPlane.ClipPlaneID
Gets the clip plane ID.

Tekla.Structures.Model.UI.ClipPlane.Location
The clip plane location in global coordinates (XYZ).

Tekla.Structures.Model.UI.ClipPlane.UpVector
The clip plane up vector in global coordinates (XYZ).

Tekla.Structures.Model.UI.ClipPlane.View
The view the clip plane belongs to.

Tekla.Structures.Model.UI.ClipPlane.IsBorderVisible
Gets or sets a value indicating whether the clip plane border is visible.
True if the clip plane border is visible otherwise false.

Tekla.Structures.Model.UI.ClipPlane.IsScissorVisible
Gets or sets  a value indicating whether the clip plane scissor icon is visible.
True if the scissor icon is visible otherwise false.

Tekla.Structures.Model.UI.ClipPlane.Insert
Creates a new clip plane to the application view.
The application view must be visible.
Returns: True on success.

Tekla.Structures.Model.UI.ClipPlane.Delete
Deletes the clip plane from the application view.
The application view must be visible.
Returns: True on success.

Tekla.Structures.Model.UI.ClipPlane.Modify
Modifies the clip plane position in the application view.
The application view must be visible.
Returns: True on success.

Tekla.Structures.Model.UI.ClipPlane.#ctor
Initializes a new instance of the Tekla.Structures.Model.UI.ClipPlane class.

Tekla.Structures.Model.UI.ClipPlane.#ctor(System.Int32)
Initializes a new instance of the Tekla.Structures.Model.UI.ClipPlane class with the specified clip plane ID.
ID: The clip plane ID.